{
  "docs": [
    "Q: What are the common symptoms of diabetes?\nA: Increased thirst, frequent urination, fatigue, blurred vision, and slow wound healing.",
    "Q: What is hypertension?\nA: Hypertension is high blood pressure, a condition where the force of blood against artery walls is consistently too high.",
    "Q: What are the symptoms of hypertension?\nA: Often no symptoms; severe hypertension may cause headaches, shortness of breath, or nosebleeds.",
    "Q: What is anemia?\nA: A condition in which the blood doesn't have enough healthy red blood cells.",
    "Q: What are the symptoms of anemia?\nA: Fatigue, pale skin, dizziness, shortness of breath, and cold hands/feet.",
    "Q: What is asthma?\nA: A chronic condition that affects the airways, causing difficulty in breathing.",
    "Q: What are common asthma symptoms?\nA: Wheezing, coughing, chest tightness, and shortness of breath.",
    "Q: What is COVID-19?\nA: A viral illness caused by the coronavirus SARS-CoV-2.",
    "Q: What are symptoms of COVID-19?\nA: Fever, cough, tiredness, loss of taste/smell, sore throat.",
    "Q: What is dehydration?\nA: A condition caused by not having enough fluids in the body.",
    "Q: What are dehydration symptoms?\nA: Dry mouth, dizziness, dark urine, fatigue, headache.",
    "Q: What is migraine?\nA: A neurological condition causing severe headaches often with nausea and sensitivity to light.",
    "Q: What are migraine symptoms?\nA: Pulsating headache, visual disturbances, vomiting, sensitivity to light/sound.",
    "Q: What is obesity?\nA: A medical condition involving excessive body fat that increases health risks.",
    "Q: What are the causes of obesity?\nA: Poor diet, lack of physical activity, genetics, environment, and certain medical conditions.",
    "Q: What is flu?\nA: A contagious respiratory illness caused by influenza viruses.",
    "Q: What are the symptoms of flu?\nA: Fever, chills, cough, sore throat, runny nose, muscle aches.",
    "Q: What is a cold?\nA: A mild viral infection of the nose and throat.",
    "Q: What are the symptoms of common cold?\nA: Sneezing, runny nose, sore throat, cough, mild fever."
  ]
}